; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v2)
		(pred_4 ?v8)
		(pred_5 ?v3)
		(pred_2 ?v3)
		(pred_3 ?v8 ?v3)
		(pred_6)
		(pred_1 ?v8))

   (:action op_3
       :parameters  (?v1 ?v7)
       :precondition (and (not-eq ?v1 ?v7) 
                          (pred_5 ?v1) (pred_5 ?v7) (pred_2 ?v1))
       :effect (and  (pred_2 ?v7)
		     (not (pred_2 ?v1))))


   (:action op_1
       :parameters (?v6 ?v4)
       :precondition  (and  (pred_4 ?v6) (pred_5 ?v4)
			    (pred_3 ?v6 ?v4) (pred_2 ?v4) (pred_6))
       :effect (and (pred_1 ?v6)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v6  ?v4)
       :precondition  (and  (pred_4 ?v6) (pred_5 ?v4)
			    (pred_1 ?v6) (pred_2 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_6)
		    (not (pred_1 ?v6)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_03 obj_02 obj_09 obj_04 obj_08 obj_07 
          obj_06 obj_05 obj_01 
)
(:init
(pred_5 obj_03)
(pred_5 obj_02)
(pred_5 obj_09)
(pred_5 obj_04)
(pred_5 obj_08)
(pred_5 obj_07)
(pred_4 obj_06)
(pred_4 obj_05)
(pred_4 obj_01)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(pred_6)
(pred_3 obj_06 obj_03)
(pred_3 obj_05 obj_08)
(pred_3 obj_01 obj_07)
(pred_2 obj_09)
)
(:goal
(and
(pred_3 obj_06 obj_09)
(pred_3 obj_05 obj_08)
(pred_3 obj_01 obj_07)
)
)

(:constraints
  (sometime-before  (pred_3 obj_06 obj_09) (pred_2 obj_02))
)
)

; plan
1. (op_3 obj_09 obj_03)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_03)
   goals met: 2 of 3
2. (op_1 obj_06 obj_03)
   deleted: (pred_3 obj_06 obj_03) (pred_6)
   added: (pred_1 obj_06)
   goals met: 2 of 3
3. (op_3 obj_03 obj_08)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_08)
   goals met: 2 of 3
4. (op_2 obj_06 obj_08)
   deleted: (pred_1 obj_06)
   added: (pred_3 obj_06 obj_08) (pred_6)
   goals met: 2 of 3
5. (op_1 obj_05 obj_08)
   deleted: (pred_3 obj_05 obj_08) (pred_6)
   added: (pred_1 obj_05)
   goals met: 1 of 3
6. (op_3 obj_08 obj_02)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_02)
   goals met: 1 of 3
7. (op_2 obj_05 obj_02)
   deleted: (pred_1 obj_05)
   added: (pred_3 obj_05 obj_02) (pred_6)
   goals met: 1 of 3
8. (op_3 obj_02 obj_08)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_08)
   goals met: 1 of 3
9. (op_1 obj_06 obj_08)
   deleted: (pred_3 obj_06 obj_08) (pred_6)
   added: (pred_1 obj_06)
   goals met: 1 of 3
10. (op_3 obj_08 obj_09)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_09)
   goals met: 1 of 3
11. (op_2 obj_06 obj_09)
   deleted: (pred_1 obj_06)
   added: (pred_3 obj_06 obj_09) (pred_6)
   goals met: 2 of 3
12. (op_3 obj_09 obj_02)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_02)
   goals met: 2 of 3
13. (op_1 obj_05 obj_02)
   deleted: (pred_3 obj_05 obj_02) (pred_6)
   added: (pred_1 obj_05)
   goals met: 2 of 3
14. (op_3 obj_02 obj_08)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_08)
   goals met: 2 of 3
15. (op_2 obj_05 obj_08)
   deleted: (pred_1 obj_05)
   added: (pred_3 obj_05 obj_08) (pred_6)
   goals met: 3 of 3
